fun main(){
    
        println ("Целочисленные типы данных используются для хранения целых чисел без дробной части. Они могут быть знаковыми или беззнаковыми.")
        println ("Знаковые целочисленные типы данных могут хранить отрицательные числа. ")
        println ("Беззнаковые целочисленные типы данных могут хранить только положительные числа.")
        println ("Строки могут рассматриваться как один из типов несвязных структур данных.")
        println ("Структуры данных могут быть классифицированы по следующим критериям: ")
        println ("По составу. Простые (неделимые единицы) и сложные (интегрированные).")
        println ("По наличию связей. Массивы, векторы, строки, стеки (Last In, First Out), очереди (First In, First Out). ")
        println ("По уровню изменчивости. Статические, полустатические и динамические. ")
        println ("По упорядоченности элементов. Нелинейные (деревья, графы, многосвязные списки) и линейные (строки, векторы, массивы, стеки, очереди)")
        println ("Int — тип данных для работы с целыми числами.")
        println ("String — тип данных для работы с последовательностями символов (текстом).")

}